<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Int_SQL_Data_Analytics_Course/blob/main/6_Data_Cleaning/1_Conditional_Handle_Nulls.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Conditonal Expressions for Nulls

## Overview

### 🥅 Analysis Goals

Understand customer-level revenue, cohort classification, and order behavior to assess customer value and purchasing patterns.
- **Handle Missing Values**: Replace NULL values with appropriate defaults using COALESCE to ensure data consistency and accurate analysis
- **Clean Revenue Data**: Calculate total net revenue and number of orders per customer, replacing NULL values with 0 for accurate aggregation
- **Cohort Analysis**: Join customer data with sales information using LEFT JOIN to maintain all customer records while analyzing purchase patterns

### 📘 Concepts Covered

- `COALESCE`
- `NULLIF`

[Source Documentation for Conditional Expressions](https://www.postgresql.org/docs/17/functions-conditional.html)

In [81]:
import sys
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# If running in Google Colab, install PostgreSQL and restore the database
if 'google.colab' in sys.modules:
    # Install PostgreSQL
    !sudo apt-get install postgresql -qq > /dev/null 2>&1

    # Start PostgreSQL service (suppress output)
    !sudo service postgresql start > /dev/null 2>&1

    # Set password for the 'postgres' user to avoid authentication errors (suppress output)
    !sudo -u postgres psql -c "ALTER USER postgres WITH PASSWORD 'password';" > /dev/null 2>&1

    # Create the 'colab_db' database (suppress output)
    !sudo -u postgres psql -c "CREATE DATABASE contoso_100k;" > /dev/null 2>&1

    # Download the PostgreSQL .sql dump
    !wget -q -O contoso_100k.sql https://github.com/lukebarousse/Int_SQL_Data_Analytics_Course/releases/download/v.0.0.0/contoso_100k.sql

    # Restore the dump file into the PostgreSQL database (suppress output)
    !sudo -u postgres psql contoso_100k < contoso_100k.sql > /dev/null 2>&1

    # Shift libraries from ipython-sql to jupysql
    !pip uninstall -y ipython-sql > /dev/null 2>&1
    !pip install jupysql > /dev/null 2>&1

# Load the sql extension for SQL magic
%load_ext sql

# Connect to the PostgreSQL database
%sql postgresql://postgres:password@localhost:5432/contoso_100k

# Enable automatic conversion of SQL results to pandas DataFrames
%config SqlMagic.autopandas = True

# Disable named parameters for SQL magic
%config SqlMagic.named_parameters = "disabled"

# Display pandas number to two decimal places
pd.options.display.float_format = '{:.2f}'.format

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting and switching to connection 'postgresql://postgres:***@localhost:5432/contoso_100k'

---
## COALESCE vs NULLIF


### Key Differences

- COALESCE accepts multiple arguments and works through them until it finds something that isn't NULL
- NULLIF only takes exactly two arguments and is specifically for converting matching values to NULL

### Simple Way to Remember

- COALESCE turns NULLs into values (NULL → value)
- NULLIF turns matching values into NULL (value → NULL)

### Example

#### Create a table of "real" data jobs

In [84]:
%%sql

-- Create a table of "real" data jobs
CREATE TABLE data_jobs (
    id INT,
    job_title VARCHAR(30),
    is_real_job VARCHAR(20),
    salary INT
);

-- Insert our "professional" opinions
INSERT INTO data_jobs VALUES
(1, 'Data Analyst', 'yes', NULL),
(2, 'Data Scientist', NULL, 140000),
(3, 'Data Engineer', 'kinda', 120000);

SELECT * FROM data_jobs;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

3 rows affected.

3 rows affected.

   id       job_title is_real_job    salary
0   1    Data Analyst         yes       NaN
1   2  Data Scientist        None 140000.00
2   3   Data Engineer       kinda 120000.00

#### Use COALESCE to turn NULLs into values

In [85]:
%%sql

SELECT 
    job_title,
    COALESCE(is_real_job, 'questionable') AS is_real_job,
    COALESCE(salary, 0) AS salary
FROM data_jobs;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

3 rows affected.

        job_title   is_real_job  salary
0    Data Analyst           yes       0
1  Data Scientist  questionable  140000
2   Data Engineer         kinda  120000

In [86]:
%%sql

SELECT 
    *,
    COALESCE(is_real_job, salary::text, '2nd Backup') AS salary_as_backup
FROM data_jobs;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

3 rows affected.

   id       job_title is_real_job    salary salary_as_backup
0   1    Data Analyst         yes       NaN              yes
1   2  Data Scientist        None 140000.00           140000
2   3   Data Engineer       kinda 120000.00            kinda

#### Use NULLIF to turn matching values into NULL

In [62]:
%%sql

SELECT 
    job_title,
    NULLIF(is_real_job, 'kinda') AS is_real_job,
    NULLIF(salary, 100000) AS salary
FROM data_jobs;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

3 rows affected.

        job_title is_real_job    salary
0    Data Analyst         yes       NaN
1  Data Scientist        None       NaN
2   Data Engineer        None 120000.00

In [83]:
%%sql

-- Clean up our controversial table
DROP TABLE data_jobs;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

Empty DataFrame
Columns: []
Index: []

---
## COALESCE

### 📝 Notes

**`COALESCE()`**

- **COALESCE**: Returns the first non-null value from a list of expressions.

- Syntax:

  ```sql
  SELECT COALESCE(expression1, expression2, ..., default_value);
  ```

- Used to replace `NULL` values with a default. Common in reporting and data cleaning, such as filling missing values with a placeholder.

### 🔑 Key Concepts
- **📊 Business Terms**: 
  - Customer Lifetime Value (LTV): Total revenue generated by a customer over time
  - Net Revenue: Total revenue after accounting for all adjustments
- **💡 Why It Matters**: Ensures consistent customer data analysis
    - Enables accurate customer revenue tracking
    - Prevents missing data from skewing analysis results
    - Maintains data integrity in customer-level calculations
- **🎯 Common Use Cases**: 
  - Customer name standardization
  - Revenue calculations
  - Customer data cleaning
- **📈 Related KPIs**: 
  - Customer net revenue
  - Customer count
  - Data completeness metrics

### 📈 Analysis

- Returned the cleaned customer's LTV.
- Calculates each customer's total net revenue.

#### Cleaned Customer's LTV

**`COALESCE`**

1. Write in a query that gets the LTV for each customer. 
   - Selects `customerkey` to group revenue calculations by customer.  
   - Calculates `net_revenue` using `SUM(quantity * netprice * exchangerate)`.  
   - Uses `GROUP BY customerkey` to aggregate revenue per customer.

In [64]:
%%sql
    
SELECT
    customerkey,
    SUM(quantity * netprice * exchangerate) AS ltv
FROM sales
GROUP BY
    customerkey

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

       customerkey     ltv
0          2044589 2470.73
1          1603477  136.62
2           876049 2601.13
3          1469222 5278.54
4          2089398   98.39
...            ...     ...
49482       853617  903.31
49483      1573639 6973.42
49484      1355936  149.99
49485       967453    5.40
49486        34354  828.80

[49487 rows x 2 columns]

2. Put the query into a CTE (`sales_data`), then `LEFT JOIN` this CTE onto the customer table to return every customer's cleaned name and their LTV. 
   - Defines `sales_data` as a CTE that calculates `net_revenue` per customer.  
   - In the main query:
        - 🔔 Performs a `LEFT JOIN` on `customer` to retain all customers, even those without sales.  
        - 🔔 Uses `COALESCE(s.net_revenue, 0)` to ensure customers without sales show `0` LTV instead of `NULL`.

In [65]:
%%sql

-- Put query into a CTE
WITH sales_data AS (
        SELECT
            customerkey,
            SUM(quantity * netprice * exchangerate) AS net_revenue
        FROM sales
        GROUP BY
            customerkey
)

SELECT
    c.customerkey,
    s.net_revenue,
    COALESCE(s.net_revenue, 0) AS cleaned_net_revenue
FROM customer c
LEFT JOIN sales_data s ON c.customerkey = s.customerkey
LIMIT 10

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

   customerkey  net_revenue  cleaned_net_revenue
0           15      2217.41              2217.41
1           23          NaN                 0.00
2           36          NaN                 0.00
3          120          NaN                 0.00
4          180      2510.22              2510.22
5          185      1395.52              1395.52
6          189          NaN                 0.00
7          210          NaN                 0.00
8          225          NaN                 0.00
9          243       287.67               287.67

<img src="../Resources/images/6.1_customer_ltv.png" alt="Customer LTV" width="50%">

> ⚠️ **Chart Note**: This plots only 15 of our customers for better visualization.

3. Calculate the average net revenue for customers that have sales and the average net revenue for all customers.
   - Use `AVG` to calculate the average net revenue for customers that have sales.
   - Use `AVG(COALESCE(s.net_revenue, 0))` to calculate the average net revenue for all customers.

In [66]:
%%sql

-- Put query into a CTE
WITH sales_data AS (
        SELECT
            customerkey,
            SUM(quantity * netprice * exchangerate) AS net_revenue
        FROM sales
        GROUP BY
            customerkey
)

SELECT
    AVG(s.net_revenue) AS spending_customers_avg_net_revenue,  -- average net revenue for customers that have sales
    AVG(COALESCE(s.net_revenue, 0)) AS all_customers_avg_net_revenue -- average net revenue for all customers
FROM customer c
LEFT JOIN sales_data s ON c.customerkey = s.customerkey

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

1 rows affected.

   spending_customers_avg_net_revenue  all_customers_avg_net_revenue
0                             4170.94                        1965.97

<img src="../Resources/images/6.1_customer_avg_revenue.png" alt="Customer Average Revenue" width="50%">

#### Cleaned Customer's Net Revenue

**`COALESCE`**

1. Using our `cohort_analysis` view from the last lesson, get cohort information.
   - Select `customerkey`, `cohort_year`, `num_orders`, and `total_net_revenue`.

In [67]:
%%sql

SELECT
    ca.customerkey,
    ca.cohort_year,
    ca.num_orders,
    ca.total_net_revenue
FROM cohort_analysis ca;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

83099 rows affected.

       customerkey cohort_year  num_orders  total_net_revenue
0               15        2021           1            2217.41
1              180        2018           1             525.31
2              180        2018           2            1984.90
3              185        2019           1            1395.52
4              243        2016           1             287.67
...            ...         ...         ...                ...
83094      2099697        2022           3              38.20
83095      2099711        2016           1            2067.75
83096      2099711        2016           1            3940.92
83097      2099743        2022           2             469.62
83098      2099743        2022           1             598.46

[83099 rows x 4 columns]

2. Using `LEFT JOIN`, join the cohort analysis view onto the customer table to return every customer's cohort information.
   - Select `customerkey` (from the customer table), `cohort_year`, `num_orders`, and `total_net_revenue` (from the cohort analysis view).    
   - Use `LEFT JOIN` to join the cohort analysis view onto the customer table.

In [68]:
%%sql

SELECT
    c.customerkey, -- Get customer key from customer table
    ca.cohort_year,
    ca.num_orders,
    ca.total_net_revenue
FROM customer c
LEFT JOIN cohort_analysis ca ON c.customerkey = ca.customerkey;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

138602 rows affected.

        customerkey cohort_year  num_orders  total_net_revenue
0                15        2021        1.00            2217.41
1               180        2018        1.00             525.31
2               180        2018        2.00            1984.90
3               185        2019        1.00            1395.52
4               243        2016        1.00             287.67
...             ...         ...         ...                ...
138597       848857        None         NaN                NaN
138598       832488        None         NaN                NaN
138599       179345        None         NaN                NaN
138600       112055        None         NaN                NaN
138601       441712        None         NaN                NaN

[138602 rows x 4 columns]

3. Use `COALESCE` to replace `NULL` values with `0`.
   - Select `customerkey` (from the customer table), `cohort_year`, `num_orders`, and `total_net_revenue` (from the cohort analysis view).    
   - Use `LEFT JOIN` to join the cohort analysis view onto the customer table.
   - 🔔 Use `COALESCE` on `num_orders` and `total_net_revenue` to replace `NULL` values with `0` for `num_orders`.

In [69]:
%%sql

SELECT
    c.customerkey,
    ca.cohort_year,
    COALESCE(ca.num_orders, 0) AS num_orders, -- Updated
    COALESCE(ca.total_net_revenue, 0) AS total_net_revenue -- Updated
FROM customer c
LEFT JOIN cohort_analysis ca ON c.customerkey = ca.customerkey;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

138602 rows affected.

        customerkey cohort_year  num_orders  total_net_revenue
0                15        2021           1            2217.41
1               180        2018           1             525.31
2               180        2018           2            1984.90
3               185        2019           1            1395.52
4               243        2016           1             287.67
...             ...         ...         ...                ...
138597       848857        None           0               0.00
138598       832488        None           0               0.00
138599       179345        None           0               0.00
138600       112055        None           0               0.00
138601       441712        None           0               0.00

[138602 rows x 4 columns]

---
## NULLIF

### 📝 Notes

**`NULLIF`**

- **NULLIF**: Returns `NULL` if two expressions are equal; otherwise, returns the first expression.

- Syntax:

  ```sql
  SELECT NULLIF(expression1, expression2);
  ```

- Helps prevent division by zero by returning `NULL` instead of causing an error.

### 🔑 Key Concepts
- **📊 Business Terms**: 
  - Cohort Analysis: Grouping customers by acquisition year
  - Average Order Value: Revenue per order for each customer
  - Customer Orders: Number of transactions per customer
- **💡 Why It Matters**: Enables accurate customer behavior analysis
    - Prevents division by zero errors in calculations
    - Allows proper calculation of average order values
    - Helps identify customer purchasing patterns
    - Provides clear view of customer order frequency
- **🎯 Common Use Cases**: 
  - Average order calculations
  - Customer cohort analysis
  - Order pattern analysis
- **📈 Related KPIs**: 
  - Average order value
  - Order frequency
  - Cohort metrics

### 📈 Analysis

- Convert customer's with `0` LTV to `NULL`.
- Calculate each customer's average order value.

#### Replace NULL Customer's LTV

**`NULLIF`**

1. Replace `COALESCE` with `NULLIF` to ensure customers without sales show `0` LTV instead of `NULL`.
   - Defines `sales_data` as a CTE that calculates `net_revenue` per customer.  
   - In the main query:
        - 🔔 Performs a `LEFT JOIN` on `customer` to retain all customers, even those without sales.  
        - 🔔 Uses `NULLIF(s.net_revenue, 0)` to ensure customers without sales show `0` LTV instead of `NULL`.

In [70]:
%%sql

WITH sales_data AS (
        SELECT
            customerkey,
            SUM(quantity * netprice * exchangerate) AS net_revenue
        FROM sales
        GROUP BY
            customerkey
)

SELECT
    c.customerkey,
    s.net_revenue,
    NULLIF(s.net_revenue, 0) AS cleaned_net_revenue -- Updated
FROM customer c
LEFT JOIN sales_data s ON c.customerkey = s.customerkey
LIMIT 10

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

   customerkey  net_revenue  cleaned_net_revenue
0           15      2217.41              2217.41
1           23          NaN                  NaN
2           36          NaN                  NaN
3          120          NaN                  NaN
4          180      2510.22              2510.22
5          185      1395.52              1395.52
6          189          NaN                  NaN
7          210          NaN                  NaN
8          225          NaN                  NaN
9          243       287.67               287.67

#### Customer Average Order Value

**`NULLIF`**

1. Add `SUM` to `num_orders` and `total_net_revenue` to get the total number of orders and total net revenue for each customer.
   - Select `customerkey` (from the customer table) and `cohort_year` (from the cohort analysis view)
   `num_orders`, and `total_net_revenue`.    
   - Use `LEFT JOIN` to join the cohort analysis view onto the customer table.
   - Use `COALESCE` on `num_orders` and `total_net_revenue` to replace `NULL` values with `0` for `num_orders`.
   - 🔔 Add `SUM` to `num_orders` and `total_net_revenue`.
   - 🔔 `GROUP BY` the `customerkey` and `cohort_year`.

In [71]:
%%sql

SELECT
    c.customerkey,
    ca.cohort_year,
    SUM(COALESCE(ca.num_orders, 0)) AS num_orders, -- Updated
    SUM(COALESCE(ca.total_net_revenue, 0)) AS total_net_revenue -- Updated
FROM customer c
LEFT JOIN cohort_analysis ca ON c.customerkey = ca.customerkey
GROUP BY 
    c.customerkey, 
    ca.cohort_year

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

104990 rows affected.

        customerkey cohort_year num_orders  total_net_revenue
0                15        2021          1            2217.41
1                23        None          0               0.00
2                36        None          0               0.00
3               120        None          0               0.00
4               180        2018          3            2510.22
...             ...         ...        ...                ...
104985      2099639        None          0               0.00
104986      2099656        2023         13           10404.68
104987      2099697        2022          3              38.20
104988      2099711        2016          2            6008.67
104989      2099743        2022          3            1068.08

[104990 rows x 4 columns]

2. Calculate each customer's average order value.
   - Select `customerkey` (from the customer table) and `cohort_year` (from the cohort analysis view)
   `num_orders`, and `total_net_revenue`.    
   - Use `LEFT JOIN` to join the cohort analysis view onto the customer table.
   - Use `COALESCE` on `num_orders` and `total_net_revenue` to replace `NULL` values with `0` for `num_orders`.
   - Add `SUM` to `num_orders` and `total_net_revenue`.
   - 🔔 Calculate `avg_order_value` by dividing `total_net_revenue` by `num_orders` and add `NULLIF` to `num_orders` to prevent division by zero.
   - `GROUP BY` the `customerkey` and `cohort_year`.

In [89]:
%%sql

SELECT
    c.customerkey,
    ca.cohort_year,
    SUM(COALESCE(ca.num_orders, 0)) AS num_orders,
    SUM(COALESCE(ca.total_net_revenue, 0)) AS total_net_revenue,
    SUM(ca.total_net_revenue) / SUM(NULLIF(ca.num_orders, 0)) AS avg_order_value  -- Added: Prevents division by zero
FROM customer c
LEFT JOIN cohort_analysis ca ON c.customerkey = ca.customerkey
GROUP BY 
    c.customerkey, 
    ca.cohort_year
LIMIT 10

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

   customerkey cohort_year num_orders  total_net_revenue  avg_order_value
0           15        2021          1            2217.41          2217.41
1           23        None          0               0.00              NaN
2           36        None          0               0.00              NaN
3          120        None          0               0.00              NaN
4          180        2018          3            2510.22           836.74
5          185        2019          1            1395.52          1395.52
6          189        None          0               0.00              NaN
7          210        None          0               0.00              NaN
8          225        None          0               0.00              NaN
9          243        2016          1             287.67           287.67

<img src="../Resources/images/6.1_customer_avg_rev.png" alt="Customer Average Revenue" width="50%">

> ⚠️ **Chart Note**: This plots only 15 of our customers for better visualization.

### 💡 What's the difference between `COALESCE` and `NULLIF`

- `NULLIF(expr1, expr2)` Returns NULL if `expr1 = expr2`, otherwise returns `expr1` (used to nullify specific values).  
- `COALESCE(expr1, expr2, ...)`: Returns the first non-NULL value from a list (used to replace NULLs with defaults).  
- **Difference:** `NULLIF` creates NULLs, while `COALESCE` replaces NULLs.